{"intro":"The Eurovision Song Contest is one of the biggest popularity contests in the world. The winner is decided by a continent wide televoting system and a professional jury from each country. But today, popularity can also be measured in another way: by counting online searches. In 2017 search activity predicted the Contest winner correctly, last year the predicted runner up won it. How close is the Eurosearch Song Contest to the Eurovision Song Contest this year?","rankingintro":"If countries would award points to each other based on search activity for other countries’ contestants and using the famous 12 point voting system of the Eurovision Song Contest, this would be the result:","rankingnote":"*This prediction is based on the search activity during the period 6/05-12/05 and will be updated on Friday 17/05, after the semi-finals.","rankingcomment":"COMMENT ON THE RANKING (UPDATED AFTER THE FINAL)","mapintro":"On the map below, you can see which countries searched the most for the contestant of your country, and for which contestants your country searched the most. Switch from the geographic  map to the grid map to better represent smaller countries.","lookback1":"Search activity has proved to be a good predictor for the Contest results in 2017 and 2018 [2017, 2018 and also this year]. But was this always the case, and can we confidently say that searches can reliably predict the Eurovision Song Contest? Or were the good predictions based on coincidence?","lookback2":"To check this, we gathered the data from the past 15 editions of the Contest. Because the rules of the voting changed quite considerably during this period, we focus on the televoting data. The winner from the televoting was by definition the Contest winner for the years between 2004 and 2008, since 2009 the professional jury also has its say in the Contests outcome. But usually the televoting results are in line with the overall results: only once (2016) the televoting winner was not the overall winner.","lookback3":"As can be seen in the chart below showing the average televoting and search scores for all countries over the 2004-2018 period, there is strong positive correlation between search activity and televoting results:","smallmultintro":"But of course we need to take a look at the data for each year separately to see if predictions based on search result can be reliable.","smallmultcomment":"For some years the correlation between search and televotes was pretty strong, in others it was a bit weaker. But in 9 of the 15 years, the candidate that was searched the most was also the one receiving the most televoting points. In 8 of these 9 years, the televoting winner was also the overall winner, so a prediction based on search activity would have been correct in more than half of the years.","votingpatternintro":"A big critiques on the televoting system is that people don’t vote objectively for the song they like best, but also let cultural, historical and linguistic ties they have with other countries play a role in their voting. The data shows that this is definitely the case. The following chart displays the cumulative televoting points awarded from one country to another during the 2004-2018 period.","votingpatterncomment1":"The most consistent televoting patterns are Belarus awarding points to Russia, Cyprus to Greece, Denmark to Sweden and Moldova to Romania: all countries sharing borders, history and/or language.","votingpatterncomment2":"And there is a correlation between search activity and televoting. But the correlation isn’t perfect: some countries show more search activity for candidates of another country then they actually vote for candidates of that country (Belgium, why are you not voting for France, while you are clearly searching for the French candidates?). Or some countries don’t search much for other countries’ candidates, but they do vote for them (Moldova and Spain do this for Romanian candidates)","methodology1":"The televoting data is from Eurovision World and was also cross-referenced against Wikipedia. For the years 2009-13 this is combined data for jury + televoting. For the other years this is pure televoting.","methodology2":"The search interest data for 2004-18 was collected in March 2019. It spans the 7 days before the date of the Eurovision final for each year. Data is pulled using language-agnostic Google Knowledge Graph topics on each of the acts competing in the contest. Once the raw data has been collected, points are assigned according to the Eurovision scoring model. We have previously published data for 2017 and 2018.","methodology3":"Search interest for 2019 was collected on XXXX for the previous 7 days. We ran two semi-finals, and have simulated the final based on the predicted qualifiers."}