{"intro":"What if Google searches were used to award points in the Eurovision Song Contest? And how close is this prediction based on search activity to the real Song Contest’s outcome?","generalintro":"The Eurovision Song Contest is one of the biggest popularity contests in the world. Anyone in one of the 41 competing countries can vote for their favourite song through a continent wide televoting system. But today, popularity can also be measured in another way: by counting online searches. So, how close is the Eurosearch Song Contest to the Eurovision Song Contest?[a]","rankingintro":"If countries awarded points based on search activity for other countries’ contestants, using Eurovision’s <a href=”https://eurovision.tv/about/voting”>famous 12-point voting system</a>, Latvia would receive the most points:","rankingnote":"This prediction is based on the search activity during the period 6/05-12/05 and will be updated on Friday 17/05, after the semi-finals.","rankingcomment":"Here comes the comment on the ranking, which will be updated after the semi-finals as well as after the final","mapintro":"The map below shows <strong>which countries searched the most for the contestant of other countries</strong>. Colors represent imaginary points awarded to and from each country, using the 12 point system. Switch from the geographic map to the grid map to better represent small countries. After the final, the map will be updated with the televoting results.","mapintro-update":"On the map below, you can see <strong>which countries searched the most for the contestant of your country, and for which contestants your country searched the most</strong>. Switch from the geographic  map to the grid map to better represent smaller countries.","lookback1-update":"Search activity has proved to be a good predictor for the Contest results since 2017. But was this always the case, and <strong>can we confidently say that searches can reliably predict the Eurovision Song Contest</strong>? Or were the good predictions based on coincidence?","lookback1":"Search activity proved itself to be a good predictor for the Contest outcome: in 2017 search activity <a href=”https://googletrends.github.io/eurosearch-2018/”>predicted the Contest winner correctly</a>, last year <a href=”https://googletrends.github.io/eurosearch-song-contest/”>the predicted runner up won it</a>. But was this always the case, and <strong>can we confidently say that searches can reliably predict the Eurovision Song Contest</strong>? Or were the good predictions based on coincidence?","lookback2":"To check this, <strong>we gathered the data from the past 15 editions of the Contest</strong>. Because voting rules changed quite considerably during this period, we focused on the televoting data. The televote winner was the Contest winner by definition from 2004-08. Since 2009, scores from a professional jury have also contributed to the outcome of the Contest.  But usually the televoting results are in line with the overall results: only once, in 2016, the televoting winner was not the overall winner.","lookback3":"The chart below shows a <strong>strong correlation between the average points for search activity and televoting results</strong> between 2004-18. The Russian candidates were the most searched for, while Bulgaria received the most televoting points on average. Czechia, Australia and the Netherlands are below the line of equal search and televoting points: they received less televoting points then could be expected from the search activity for their candidates.","smallmultintro":"But not all countries have participated in all finals of the Contest: after all, only 26 countries take part in the final every year. Countries that have participated in many finals will have scored more points and will have had more exposure to drive searches. <strong>We need to look at the data for each year separately</strong> to see if predictions based on search result can be reliable.","smallmultcomment":"For some years the correlation between search and televotes was pretty strong (see 2007, 2008 and 2014-2017), in others it was a bit weaker. In 9 of the 15 years, the top-searched candidate also received the most points from televoting. In 8 of these 9 years, the televoting winner was also the overall winner, <strong>so a prediction based on search activity would have been correct more than half of the time</strong>.","votingpatternintro":"Critics of the televoting system have suggested that countries fail to vote objectively for the best songs. It is suggested that Eurovision voters are heavily influenced by historical, cultural and linguistic ties with other countries when choosing where to cast their votes. This is backed up by the data. The following chart displays the cumulative televoting points awarded <strong>from one country to another</strong> during the 2004-2018 period. Notice how the country pairs with the most search activity (right of the chart) and most awarded televoting points (top of the chart) have shared borders, language or history.","votingpatterncomment1":"The most consistent televoting patterns are Belarus awarding points to Russia, Cyprus to Greece, Denmark to Sweden and Moldova to Romania: all countries sharing borders, history and/or language.","votingpatterncomment2":"And there is a correlation between search activity and televoting. But the correlation isn’t perfect: some countries show more search activity for candidates of another country then they actually vote for candidates of that country (Belgium, why are you not voting for France, while you are clearly searching for the French candidates?). Or some countries don’t search much for other countries’ candidates, but they do vote for them (Moldova and Spain do this for Romanian candidates)","wrapup1":"Online search activity usually doesn’t have too much predictive power. You can’t predict elections and the outcome of things like sports events based on what people search for. But the Eurovision Song Contest is a special case: search activity is strongly correlated with the outcome of the Contest. There are two main reasons for this.","wrapup2":"The first is that <strong>people go online to find information about the artists and songs they like. They don’t do that for songs they don’t like</strong>. This is unlike search behaviour for politicians, for instance: people also also search for information about politicians they don’t like (like in the case of political scandals, for example). So the signal in the search activity data is strong.","wrapup3":"The second reason is that <strong>people have a direct way of influencing  the outcome of the Contest</strong> through the televoting system. In sports, search activity for a team can’t predict the outcome of next weekend’s game. But in the Eurovision Song Contest, people searching for a candidate they like can have a direct say in the outcome.[b]","wrapup4":"So do we still need the televoting system? Or should we just use search data to determine who gets our \"douze points\"?","methodology1":"The televoting data is from Eurovision World and was also cross-referenced against Wikipedia. For the years 2009-13 this is combined data for jury + televoting. For the other years this is pure televoting.","methodology2":"The search interest data for 2004-18 was collected in March 2019. It spans the 7 days before the date of the Eurovision final for each year. Data is pulled using language-agnostic Google Knowledge Graph topics on each of the acts competing in the contest. Once the raw data has been collected, points are assigned according to the Eurovision scoring model. We have previously published data for 2017 and 2018.","methodology3":"Search interest for 2019 was collected on XXXX for the previous 7 days. We ran two semi-finals, and have simulated the final based on the predicted qualifiers.","a":[],"b":[]}